package practices.practice2;
//В приведенных ниже заданиях необходимо вывести внизу фамилию разработчика, дату и время
//        получения задания, а также дату и время сдачи задания.
//        Добавить комментарии в программы в виде /** комментарий */, сгенерировать html-файл
//        документации. В заданиях на числа объект можно создавать в виде массива символов.
//        Ввести n чисел с консоли.
// 27. Выяснить, какое число встречается в какой строке раньше - положительное или отрицательное.
public class Runner {
}
